In [1]:
%load_ext autoreload
%autoreload 2

import duckdb
import os
import pandas as pd
import pathlib

from ibge import *

In [2]:
# Initialize DuckDB connection
conn = duckdb.connect("plants.db")

In [4]:
conn.execute("SHOW TABLES").df()

                       name
0  flora_especies_ameacadas
1                      ibge
2                   reflora
3                     sibbr

In [5]:
conn.execute("DROP TABLE IF EXISTS sibbr_br")
conn.execute("""
    CREATE TABLE sibbr_br AS
    SELECT *
    FROM sibbr s
    WHERE s.country='Brazil' OR s.country='Brasil' OR s.county='Brasil'
""")

FloatProgress(value=0.0, layout=Layout(width='auto'), style=ProgressStyle(bar_color='black'))

In [6]:
result = conn.execute("SELECT COUNT(*) FROM sibbr_br").fetchone()
print(f"Registros carregados na tabela: {result[0]:,}")

Registros carregados na tabela: 9,404,156

### Variações da país

In [7]:
conn.execute("SELECT DISTINCT(s.country) FROM sibbr_br as s WHERE s.country LIKE 'B%'").df()

  country
0  Brazil
1  Brasil

In [8]:
conn.execute("UPDATE sibbr_br SET country='Brazil' WHERE country='Brasil';")
conn.execute("SELECT DISTINCT(s.country) FROM sibbr_br as s WHERE s.country LIKE 'B%'").df()

  country
0  Brazil

### Variações de estado

In [47]:
conn.execute("SELECT DISTINCT(s.stateProvince) FROM sibbr as s LIMIT 5").df()
# conn.execute("SELECT * FROM ibge").df()

  stateProvince
0     Sao Paulo
1       Roraima
2    Alagoas al
3           nan
4         Ceara

### Variações de cidade

In [25]:
conn.execute("SELECT s.county, s.stateProvince, s.country FROM sibbr_br as s WHERE s.county LIKE 'Brasil' LIMIT 5").df()

   county stateProvince country
0  Brasil           nan     nan
1  Brasil           nan     nan
2  Brasil           nan     nan
3  Brasil           nan     nan
4  Brasil           nan     nan

In [ ]:
conn.execute("UPDATE sibbr_br SET country='Brazil', county=NULL WHERE county='Brasil';")
conn.execute("SELECT s.county, s.stateProvince, s.country FROM sibbr_br as s WHERE s.country LIKE 'Brazil' LIMIT 5").df()

     county stateProvince country
0       nan           nan  Brazil
1  Ibicoara         Bahia  Brazil
2       nan           nan  Brazil
3       nan           nan  Brazil
4       nan           nan  Brazil